Конфигурация/Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Записан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПомеченНаУдаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СостоянияДокументов/Ext/ManagerModule.bsl
Функция ПолучитьСостояниеДокумента(Документ) Экспорт
	
	Если Документ.ПометкаУдаления Тогда
		Состояние = Перечисления.СостоянияДокументов.ПомеченНаУдаление;
	ИначеЕсли Документ.Проведен Тогда
		Состояние = Перечисления.СостоянияДокументов.Проведен;
	Иначе
		Состояние = Перечисления.СостоянияДокументов.Записан;
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции // ПолучитьСостояниеДокумента
